
#变量赋值的三个方式
x = 1

a,b = 1,2

o = p = 2

#变量的好处一，易维护
#如果要将 蔡启越 修改成 xxx，那就要该好几次
# print("蔡启越" + '1')
# print("蔡启越" + '2')
# print("蔡启越" + '3')
# print("蔡启越" + '4') 
# print("蔡启越" + '5')
# print("蔡启越" + '6')
# print("蔡启越" + '7')

name = '蔡启越'#只需要改一次
print(name + '1')
print(name + '2')
print(name + '3')
print(name + '4')
print(name + '5')
print(name + '6')
print(name + '7')


#变量的好处二，节省内存和磁盘空间
#遇到长的字符串，每次都要 创建一个 字符串实例对象，分配一个新的内存空间，共分配了好几个，占内存，且文件大小变大了，占磁盘空间
# print("你好好好哈哈哈哈哈哈哈哈哈哈哈哈哈哈" + 'ccc')
# print("你好好好哈哈哈哈哈哈哈哈哈哈哈哈哈哈" + 'ccc')
# print("你好好好哈哈哈哈哈哈哈哈哈哈哈哈哈哈" + 'ccc')
# print("你好好好哈哈哈哈哈哈哈哈哈哈哈哈哈哈" + 'ccc')
# print("你好好好哈哈哈哈哈哈哈哈哈哈哈哈哈哈" + 'ccc')
# print("你好好好哈哈哈哈哈哈哈哈哈哈哈哈哈哈" + 'ccc')
# print("你好好好哈哈哈哈哈哈哈哈哈哈哈哈哈哈" + 'ccc')
# print("你好好好哈哈哈哈哈哈哈哈哈哈哈哈哈哈" + 'ccc')
# print("你好好好哈哈哈哈哈哈哈哈哈哈哈哈哈哈" + 'ccc')


#只创建一个 字符串实例对象，只分配一个内存空间，用变量引用该内存地址
#每次需要打印字符串时，只需要通过变量中的内存地址去取值就可以，节省内存，而且只需要存一份字符串，文件大小变小，节省磁盘空间
sentence = '你好好好哈哈哈哈哈哈哈哈哈哈哈哈哈哈'
print(sentence + 'ccc')